# The task of the "Minimum of two numbers»

#Условие
#Даны два целых числа. Выведите значение наименьшего из них.

a = int(input())
b = int(input())

if a < b:
    print(a)
else:
    print(b)
