# Условие
# Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке.

a = int(input())
b = int(input())
c = int(input())

print(a + b + c)

# Если аргументов намного больше, то можно так
# c = 0
# for i in range(10):
#     a = int(input())
#     c += a
# print(c)