# Условие
# Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!).

number = int(input())

print(f"The next number for the number {number} is {number+1}.\nThe previous number for the number {number} is {number-1}.")