# Условие
# Дана строка. Удалите из этой строки все символы @.

print(input('Введите текст:   ').replace('@', ''))
