# Условие
# Дана строка. Замените в этой строке все цифры 1 на
# слово one.

print(input('Введите текст:...').replace('1', 'one'))